marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_RGM.h
/* MC_RGM: Destructive Event Status Register Address. */
#define MC_RGM_DES_ADDR32                   ((uint32)(MC_RGM_BASEADDR + (uint32)0x00UL))
/* MC_RGM: Destructive Event Reset Disable Register Address. */
#define MC_RGM_DERD_ADDR32                  ((uint32)(MC_RGM_BASEADDR + (uint32)0x0010U))
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_06_01_00) || \
     (IPV_MC == IPV_MC_04_06_05_00) \
    )
    /* MC_RGM: Destructive Event Alternate Request Register Address. */
    #define MC_RGM_DEAR_ADDR32              ((uint32)(MC_RGM_BASEADDR + (uint32)0x0020U))
#endif /* ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_00_15_15) ||
           (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_06_01_00) ||
           (IPV_MC == IPV_MC_04_06_05_00) ) */

/* MC_RGM: Destructive' Bidirectional Reset Enable Register (MC_RGM_DBRE) */
#define MC_RGM_DBRE_ADDR32                  ((uint32)(MC_RGM_BASEADDR + (uint32)0x0030U))

/* functional reset control */
/* MC_RGM: Functional Event Status Register Address. */
#define MC_RGM_FES_ADDR32                   ((uint32)(MC_RGM_BASEADDR + (uint32)0x0300U))
/* MC_RGM: Functional Event Reset Disable Register Address. */
#define MC_RGM_FERD_ADDR32                  ((uint32)(MC_RGM_BASEADDR + (uint32)0x0310U))
/* MC_RGM: Functional Event Alternate Request Register Address. */
#define MC_RGM_FEAR_ADDR32                  ((uint32)(MC_RGM_BASEADDR + (uint32)0x0320U))
/* MC_RGM: Functional Bidirectional Reset Enable Register Address. */
#define MC_RGM_FBRE_ADDR32                  ((uint32)(MC_RGM_BASEADDR + (uint32)0x0330U))
/* MC_RGM: Functional Event Short Sequence Register Address. */
#define MC_RGM_FESS_ADDR32                  ((uint32)(MC_RGM_BASEADDR + (uint32)0x0340U))
/* MC_RGM: DDR Handshake Enable Register. */
#define MC_RGM_DDR_HE_ADDR32                ((uint32)(MC_RGM_BASEADDR + (uint32)0x0350U))
/* MC_RGM: DDR Handshake Status Register. */
#define MC_RGM_DDR_HS_ADDR32                ((uint32)(MC_RGM_BASEADDR + (uint32)0x0354U))
/* MC_RGM: Functional Reset Handshake Enable. */
#define MC_RGM_FRHE_ADDR32                  ((uint32)(MC_RGM_BASEADDR + (uint32)0x0358U))
/* MC_RGM: Functional Reset Escalation Counter. */
#define MC_RGM_DDR_FREC_ADDR32              ((uint32)(MC_RGM_BASEADDR + (uint32)0x0600U))

#if (IPV_MC == IPV_MC_05_00_00_10)
    /* MC_RGM: Functional Reset Threshold Register Address. */
    #define MC_RGM_FRET_ADDR8                   ((uint32)(MC_RGM_BASEADDR + (uint32)0x0607U))
    /* MC_RGM: Destructive Reset Escalation Threshold Register Address. */
    #define MC_RGM_DRET_ADDR8               ((uint32)(MC_RGM_BASEADDR + (uint32)0x060BU))
#else
    /* MC_RGM: Functional Reset Threshold Register Address. */
    #define MC_RGM_FRET_ADDR8                   ((uint32)(MC_RGM_BASEADDR + (uint32)0x0604U))
    /* MC_RGM: Destructive Reset Escalation Threshold Register Address. */
    #define MC_RGM_DRET_ADDR8               ((uint32)(MC_RGM_BASEADDR + (uint32)0x0608U))
    /* MC_RGM: Functional Reset Threshold Register Address. */
    #define MC_RGM_FRET_ADDR32                   ((uint32)(MC_RGM_BASEADDR + (uint32)0x0604U))
    /* MC_RGM: Destructive Reset Escalation Threshold Register Address. */
    #define MC_RGM_DRET_ADDR32                   ((uint32)(MC_RGM_BASEADDR + (uint32)0x0608U))
#endif

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
/* MC_RGM: External Reset Output Extension Control Register. */
#define MC_RGM_EROEC_ADDR8                  ((uint32)(MC_RGM_BASEADDR + (uint32)0x060CU))
#endif /* ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_00_15_15)) */

/***********************************************/
/***************** MC_RGM_DES ******************/
/***********************************************/
#if (IPV_MC == IPV_MC_04_04_01_00)
    #define MC_RGM_DES_RWBITS_MASK32        ((uint32)0x01800339U)
#elif (IPV_MC == IPV_MC_04_03_00_00)
    #define MC_RGM_DES_RWBITS_MASK32        ((uint32)0x01800119U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    #define MC_RGM_DES_RWBITS_MASK32        ((uint32)0x0180C73BU)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    #define MC_RGM_DES_RWBITS_MASK32        ((uint32)0x0380077BU)
#elif (IPV_MC == IPV_MC_04_06_05_00)
#if (MCU_MIPI_PRESENT == STD_ON)
    #define MC_RGM_DES_RWBITS_MASK32        ((uint32)0x01FFBFF79)
#else
    #define MC_RGM_DES_RWBITS_MASK32        ((uint32)0x0DFBFF39U)
#endif
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_RGM_DES_RWBITS_MASK32        ((uint32)0x00001369U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_RGM_DES_RWBITS_MASK32        ((uint32)0x000005FDU)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_RGM_DES_RWBITS_MASK32        ((uint32)0x78001179U)
#endif

#define MC_RGM_DES_RESBITS_MASK32           ((uint32)0x00000000U)

/* flags that generate IRQ events */
#if (IPV_MC == IPV_MC_04_04_01_00)
    /* DES can not generate IRQ for this version */
#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    /* DEAR:AR_TSR_DEST => DES:F_TSR_DEST */
    #define MC_RGM_DES_IRQ_BITS_MASK32          ((uint32)0x00800000U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* DEAR:AR_PORST => DES:F_PORST */
    #define MC_RGM_DES_IRQ_BITS_MASK32          ((uint32)0x00000002U)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    /* DEAR:AR_PORST => DES:F_PORST */
    #define MC_RGM_DES_IRQ_BITS_MASK32          ((uint32)0x00800002U)
#elif ((IPV_MC == IPV_MC_05_00_00_10) || (IPV_MC == IPV_MC_06_00_00_10))
    #define MC_RGM_DES_IRQ_BITS_MASK32          ((uint32)0x00000000U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_RGM_DES_IRQ_BITS_MASK32          ((uint32)0x00000000U)
#endif

/* RGM_DES[F_POR] bit mask. */
#define MC_RGM_DES_F_POR_MASK32             ((uint32)0x00000001U)

#if ((IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) \
    )
#define MC_RGM_DES_F_PORST_MASK32           ((uint32)0x00000002U)
#endif  /* ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||
            (IPV_MC == IPV_MC_04_06_01_00)) */

/* RGM_DES[F_SOFT_DEST] bit mask. */
#define MC_RGM_DES_F_SOFT_DEST_MASK32       ((uint32)0x00000008U)
/* RGM_DES[F_FFRR] bit mask. */
#define MC_RGM_DES_F_FFRR_MASK32            ((uint32)0x00000010U)

/* RGM_DES[F_SSCM_SEC] bit mask. */
#define MC_RGM_DES_F_SSCM_SEC_MASK32        ((uint32)0x00000010U)

