marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_RGM.h
/* RGM_DES[F_FUNC_ESC] bit mask. */
#define MC_RGM_DES_F_FUNC_ESC_MASK32        ((uint32)0x00000020U)

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) || \
     (IPV_MC == IPV_MC_05_00_00_10) || (IPV_MC == IPV_MC_04_04_01_00) || \
     (IPV_MC == IPV_MC_06_00_00_10) \
    )
    /* RGM_DES[F_SUF] bit mask. */
    #define MC_RGM_DES_F_SUF_MASK32             ((uint32)0x00000020U)

#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* RGM_DES[F_SUF] bit mask. */
    #define MC_RGM_DES_F_SUF_MASK32             ((uint32)0x00000040U)
#endif

#define MC_RGM_DES_F_DDR_HNDSHK_TO_MASK32       ((uint32)0x00000040U)

#if (IPV_MC == IPV_MC_04_06_01_00)
    /* RGM_DES[F_SSR] bit mask. */
    #define MC_RGM_DES_F_SSR_MASK32             ((uint32)0x00000040U)
#endif

/* RGM_DES[F_SSSR] bit mask. */
#define MC_RGM_F_SSSR_MASK32                ((uint32)0x00000040U)

/* RGM_DES[F_SWT0_RES] bit mask. */
#define MC_RGM_DES_F_SWT0_RES_MASK32        ((uint32)0x00000080U)

/* RGM_DES[F_SWT1_RES] bit mask. */
#define MC_RGM_DES_F_SWT1_RES_MASK32        ((uint32)0x00000100U)

/* RGM_DES[F_EDR] bit mask. */
#define MC_RGM_DES_F_EDR_MASK32             ((uint32)0x00000100U)

/* RGM_DES[F_EFR] bit mask. */
#define MC_RGM_DES_F_EFR_MASK32             ((uint32)0x00000100U)

/* RGM_DES[F_SWT2_RES] bit mask. */
#define MC_RGM_DES_F_SWT2_RES_MASK32        ((uint32)0x00000400U)

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_05_00_00_10) || \
     (IPV_MC == IPV_MC_04_04_01_00) \
    )
     /* RGM_DES[F_FIF] bit mask. */
    #define MC_RGM_DES_F_FIF_MASK32             ((uint32)0x00000200U)
#endif /* ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
           (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_05_00_00_10)) */

#if ((IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) \
    )
    /* RGM_DES_[F_JTAG_DEST] bit mask. */
    #define MC_RGM_DES_F_JTAG_DEST_MASK32       ((uint32)0x00000400U)
#endif /* ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||
           (IPV_MC == IPV_MC_04_06_01_00)) */

#if (IPV_MC == IPV_MC_05_00_00_10)
    /* RGM_DES_[F_JTAG] bit mask. */
    #define MC_RGM_DES_F_JTAG_MASK32            ((uint32)0x00001000U)
#endif /* (IPV_MC == IPV_MC_05_00_00_10) */

#define MC_RGM_DES_F_DBGRST_MASK32              ((uint32)0x00001000U)

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* RGM_DES_[F_SSCM_DEST] bit mask. */
    #define MC_RGM_DES_F_SSCM_DEST_MASK32       ((uint32)0x00004000U)
#endif /* ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00)) */

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* RGM_DES_[F_HSM_DEST] bit mask. */
    #define MC_RGM_DES_F_HSM_DEST_MASK32        ((uint32)0x00008000U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* RGM_DES_[F_HSM_DEST] bit mask. */
    #define MC_RGM_DES_F_HSM_DEST_MASK32        ((uint32)0x00000004U)
#endif  /* (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) */

/* RGM_DES[F_TSR_DEST] bit mask. */
#define MC_RGM_DES_F_TSR_DEST_MASK32        ((uint32)0x00800000U)

#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_04_01_00) || \
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) \
    )
    /* RGM_DES[F_VOR_DEST] bit mask. */
    #define MC_RGM_DES_F_VOR_DEST_MASK32        ((uint32)0x01000000U)
#endif

#define MC_RGM_DES_F_LVD_33_PMC_MASK32          ((uint32)0x20000000U)
#define MC_RGM_DES_F_HVD_18_MASK32              ((uint32)0x40000000U)

#if (IPV_MC == IPV_MC_04_06_01_00)
    /* RGM_DES[F_PMC] bit mask. */
    #define MC_RGM_DES_F_PMC_MASK32             ((uint32)0x02000000U)
#endif  /* (IPV_MC == IPV_MC_04_06_01_00) */

#if (IPV_MC == IPV_MC_04_06_05_00)
    #define MC_RGM_DES_F_LVD_CORE_MASK32        ((uint32)0x00000200U)
    #define MC_RGM_DES_F_HVD_CORE_MASK32        ((uint32)0x00000400U)
    #define MC_RGM_DES_F_LVD_ADC_MASK32         ((uint32)0x00000800U)
    #define MC_RGM_DES_F_HVD_ADC_MASK32         ((uint32)0x00001000U)
    #define MC_RGM_DES_F_LVD_FLASH_MASK32       ((uint32)0x00002000U)
    #define MC_RGM_DES_F_LVD_PLL_MASK32         ((uint32)0x00004000U)
    #define MC_RGM_DES_F_LVD_IO_MASK32          ((uint32)0x00008000U)
    #define MC_RGM_DES_F_LVD_PMC_MASK32         ((uint32)0x00010000U)
    #define MC_RGM_DES_F_AFE_LVD0_MASK32        ((uint32)0x00020000U)
    #define MC_RGM_DES_F_AFE_LVD1_MASK32        ((uint32)0x00040000U)
    #define MC_RGM_DES_F_AFE_LVD2_MASK32        ((uint32)0x00080000U)
    #define MC_RGM_DES_F_AFE_LVD3_MASK32        ((uint32)0x00100000U)
    #define MC_RGM_DES_F_AFE_LVD4_MASK32        ((uint32)0x00200000U)
    #define MC_RGM_DES_F_AFE_LVD5_MASK32        ((uint32)0x00400000U)
    #define MC_RGM_DES_F_AFE_LVD7_MASK32        ((uint32)0x01000000U)
    #define MC_RGM_DES_F_AFE_LVD8_MASK32        ((uint32)0x02400000U)
    #define MC_RGM_DES_F_AFE_LVD6_MASK32        ((uint32)0x04000000U)
    #define MC_RGM_DES_F_AFE_LVD9_MASK32        ((uint32)0x08000000U)
    #define MC_RGM_DES_F_LVD_MIPI_MASK32        ((uint32)0x10000000U)
#else
    #define MC_RGM_DES_F_HVD_CORE_MASK32            ((uint32)0x08000000U)
    #define MC_RGM_DES_F_LVD_CORE_MASK32            ((uint32)0x10000000U)
#endif

/***********************************************/
/***************** MC_RGM_DERD *****************/
/***********************************************/
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_05_00_00_07))
    /* used bits mask */
    #define MC_RGM_DERD_RWBITS_MASK32           ((uint32)0x00000000U)
#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    /* used bits mask */
    #define MC_RGM_DERD_RWBITS_MASK32           ((uint32)0x00800000U)
#elif (IPV_MC == IPV_MC_04_00_15_15)
    /* used bits mask */
    #define MC_RGM_DERD_RWBITS_MASK32           ((uint32)0x00000002U)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    #define MC_RGM_DERD_RWBITS_MASK32           ((uint32)0x00800002U)
#elif (IPV_MC == IPV_MC_04_01_00_00)
    #define MC_RGM_DERD_RWBITS_MASK32           ((uint32)0x00000002U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_RGM_DERD_RWBITS_MASK32           ((uint32)0x00000000U)
#endif 

/* reserved bits mask */
#define MC_RGM_DERD_RESBITS_MASK32          ((uint32)0x00000000U)

