marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_RGM.h
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_01_00) || \
     (IPV_MC == IPV_MC_04_06_05_00) \
    )
    /* Disable temperature sensor 'destructive' reset */
    #define MC_RGM_DERD_D_TSR_DEST_MASK32       ((uint32)0x00800000U)
#endif

#if ((IPV_MC == IPV_MC_04_00_15_15) || \
     (IPV_MC == IPV_MC_04_01_00_00) \
    )
    /* Disable external power-on reset */
    #define MC_RGM_DERD_D_PORST_MASK32          ((uint32)0x00000002U)
#endif /* ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) */

/***********************************************/
/***************** MC_RGM_DBRE *****************/
/***********************************************/
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00) || \
     (IPV_MC == IPV_MC_04_06_05_00) || (IPV_MC == IPV_MC_04_01_00_00) || \
     (IPV_MC == IPV_MC_05_00_00_10) || (IPV_MC == IPV_MC_05_00_00_07) || \
     (IPV_MC == IPV_MC_06_00_00_10) \
    )
    /* used bits mask */
    #define MC_RGM_DBRE_RWBITS_MASK32           ((uint32)0x00000000U)
#elif (IPV_MC == IPV_MC_04_00_15_15)
    /* used bits mask */
    #define MC_RGM_DBRE_RWBITS_MASK32           ((uint32)0x00008400U)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    /* used bits mask */
    #define MC_RGM_DBRE_RWBITS_MASK32           ((uint32)0x02000400U)
#endif

/* reserved bits mask */
#define MC_RGM_DBRE_RESBITS_MASK32              ((uint32)0x00000000U)

#if (IPV_MC == IPV_MC_04_06_01_00)
    #define MC_RGM_DBRE_BE_PMC_STF_MASK32       ((uint32)0x02000000U)
#endif
#if (IPV_MC == IPV_MC_04_00_15_15)
    /* Bidirectional Reset Enable for HSM destructive reset request */
    #define MC_RGM_DBRE_BE_HSM_DEST_MASK32      ((uint32)0x00008000U)
#endif /* ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00)) */

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_06_01_00))
    /* Bidirectional Reset Enable for JTAG destructive reset request */
    #define MC_RGM_DBRE_BE_JTAG_DEST_MASK32     ((uint32)0x00000400U)
#endif /* ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||
           (IPV_MC == IPV_MC_04_06_01_00)) */

#if (IPV_MC == IPV_MC_05_00_00_10)
    /* RGM_DBRE[BE_SOFT_DEST] bit mask */
    #define MC_RGM_DBRE_BE_SOFT_DEST_MASK32         ((uint32)0x00000008U)
    /* RGM_DBRE[BE_SUF] bit mask */
    #define MC_RGM_DBRE_BE_SUF_MASK32               ((uint32)0x00000020U)
    /* RGM_DBRE[BE_SSSR] bit mask */
    #define MC_RGM_DBRE_BE_SSSR_MASK32              ((uint32)0x00000040U)
    /* RGM_DBRE[BE_EFR] bit mask */
    #define MC_RGM_DBRE_BE_EFR_MASK32               ((uint32)0x00000100U)
    /* RGM_DBRE[BE_FIF] bit mask */
    #define MC_RGM_DBRE_BE_FIF_MASK32               ((uint32)0x00000200U)
    /* RGM_DBRE[BE_JTAG] bit mask */
    #define MC_RGM_DBRE_BE_JTAG_MASK32              ((uint32)0x00001000U)
#endif /* (IPV_MC == IPV_MC_05_00_00_10) */


/***********************************************/
/***************** MC_RGM_DEAR *****************/
/***********************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC ==IPV_MC_04_06_05_00))
    /* used bits mask */
    #define MC_RGM_DEAR_RWBITS_MASK32           ((uint32)0x00800000U)
    /* Alternate Request for temperature sensor 'destructive' reset */
    #define MC_RGM_DEAR_AR_TSR_DEST_MASK32      ((uint32)0x00800000U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* used bits mask */
    #define MC_RGM_DEAR_RWBITS_MASK32           ((uint32)0x00000002U)
    /* Alternate Request for temperature sensor 'destructive' reset */
    #define MC_RGM_DEAR_AR_PORST_MASK32         ((uint32)0x00000002U)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    /* used bits mask */
    #define MC_RGM_DEAR_RWBITS_MASK32           ((uint32)0x00000002U)
    /* Alternate Request for temperature sensor 'destructive' reset */
    #define MC_RGM_DEAR_AR_TSR_DEST_MASK32      ((uint32)0x00800000U)
    /* Alternate Request for temperature sensor 'destructive' reset */
    #define MC_RGM_DEAR_AR_PORST_MASK32         ((uint32)0x00000002U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */

/* reserved bits mask */
#define MC_RGM_DEAR_RESBITS_MASK32              ((uint32)0x00000000U)

/***********************************************/
/***************** MC_RGM_FES  *****************/
/***********************************************/
#if ((IPV_MC == IPV_MC_04_04_01_00) || \
     (IPV_MC == IPV_MC_04_03_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) \
    )
    /* used bits mask */
    #define MC_RGM_FES_RWBITS_MASK32            ((uint32)0x0180046DU)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* used bits mask */
    #define MC_RGM_FES_RWBITS_MASK32            ((uint32)0x0180846FU)
#elif (IPV_MC == IPV_MC_04_06_05_00)
    /* used bits mask */
    #define MC_RGM_FES_RWBITS_MASK32            ((uint32)0x0080046DU)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* used bits mask */
    #define MC_RGM_FES_RWBITS_MASK32            ((uint32)0x3C04C3F9U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* used bits mask */
    #define MC_RGM_FES_RWBITS_MASK32            ((uint32)0x00027FFDU)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    /* used bits mask */
    #define MC_RGM_FES_RWBITS_MASK32            ((uint32)0x0000846DU) 
#endif

/* reserved bits mask */
#define MC_RGM_FES_RESBITS_MASK32               ((uint32)0x00000000U)

/* flags that generate IRQ events */
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00))
    /* AR_VOR_FUNC 7 => F_VOR_FUNC */
    /* AR_TSR_FUNC 8 => F_TSR_FUNC */
    /* AR_JTAG_FUNC 21 => F_JTAG_FUNC */
    #define MC_RGM_FES_IRQ_BITS_MASK32              ((uint32)0x01800400U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* AR_VOR_FUNC 7 => F_VOR_FUNC */
    /* AR_TSR_FUNC 8 => F_TSR_FUNC */
    /* AR_ESR1 30 => F_ESR1 */
    #define MC_RGM_FES_IRQ_BITS_MASK32              ((uint32)0x01800002U)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    #define MC_RGM_FES_IRQ_BITS_MASK32              ((uint32)0x01800000U)
#elif (IPV_MC == IPV_MC_04_06_05_00)
    #define MC_RGM_FES_IRQ_BITS_MASK32              ((uint32)0x01800400U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_RGM_FES_IRQ_BITS_MASK32              ((uint32)0x0000C020U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    #define MC_RGM_FES_IRQ_BITS_MASK32              ((uint32)0x00027CB0U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_RGM_FES_IRQ_BITS_MASK32              ((uint32)0x00000000U)
#endif


