marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_RGM.h
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_04_01_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) \
    )
    /* Flag for voltage out of range 'functional' reset */
    #define MC_RGM_FES_F_VOR_FUNC_MASK32            ((uint32)0x01000000U)
#endif

/* Flag for temperature sensor 'functional' reset */
#define MC_RGM_FES_F_TSR_FUNC_MASK32            ((uint32)0x00800000U)

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* Flag for HSM functional reset */
    #define MC_RGM_FES_F_HSM_FUNC_MASK32            ((uint32)0x00008000U)
#endif /* (IPV_MC == IPV_MC_04_00_15_15) */

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* Flag for SWT4 Timeout functional reset */
    #define MC_RGM_FES_F_SWT4_MASK32                ((uint32)0x00008000U)
#endif

#if (IPV_MC == IPV_MC_05_00_00_07)

    /* Flag for LVD_LV_PD2_cold reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FES_F_LVD_LV_PD2_COLD_MASK32     ((uint32)0x00020000U)
    /* Flag for HVD_LVD_cold reset */
    #define MC_RGM_FES_F_HVD_LV_COLD_MASK32        ((uint32)0x00004000U)
    /* Flag for LVD_IO_A_HI reset */
    #define MC_RGM_FES_F_LVD_IO_A_HI_MASK32         ((uint32)0x00002000U)
    /* Flag for Z2_DBG reset */
    #define MC_RGM_FES_F_Z2_DBG_MASK32              ((uint32)0x00001000U)
    /* Flag for Z4B_DBG reset */
    #define MC_RGM_FES_F_Z4B_DBG_MASK32             ((uint32)0x00000800U)
    /* Flag for Z4A_DBG reset */
    #define MC_RGM_FES_F_Z4A_DBG_MASK32             ((uint32)0x00000400U)
    /* Flag for FCCU_SHORT reset */
    #define MC_RGM_FES_F_FCCU_SHORT_MASK32          ((uint32)0x00000200U)
    /* Flag for FCCU_LONG reset */
    #define MC_RGM_FES_F_FCCU_LONG_MASK32           ((uint32)0x00000100U)
    /* Flag for CMU_OLR reset */
    #define MC_RGM_FES_F_CMU_OLR_MASK32             ((uint32)0x00000080U)
    /* Flag for Self Test done reset */
    #define MC_RGM_FES_F_ST_DONE_MASK32             ((uint32)0x00000040U)
    /* Flag for JTAG Functional reset */
    #define MC_RGM_FES_F_JTAG_FUNC_MASK32           ((uint32)0x00000020U)
    /* Flag for NMI WKPU reset */
    #define MC_RGM_FES_F_NMI_WKPU_MASK32            ((uint32)0x00000010U)
    /* Flag for HSM Functional reset */
    #define MC_RGM_FES_F_HSM_FUNC_MASK32            ((uint32)0x00000004U)

#elif (IPV_MC == IPV_MC_05_00_00_10)

    /* Flag for SWT2 timeout reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FES_F_SWT2_RST_REQ_MASK32        ((uint32)0x08000000U)
    /* Flag for CM0 software reset */
    #define MC_RGM_FES_F_CM0_RST_REQ_MASK32         ((uint32)0x04000000U)
    /* Flag for LVD LV PD2 COLD reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FES_F_LVD_LV_PD2_COLD_MASK32     ((uint32)0x00008000U)
    /* Flag for HVD VDD LV PD2 reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FES_F_HVD_VDD_LV_PD2_MASK32      ((uint32)0x00004000U)
    /* Flag for FCCU Soft reaction reset */
    #define MC_RGM_FES_F_FCCU_SOFT_MASK32           ((uint32)0x00000200U)
    /* Flag for FCCU Hard reaction reset */
    #define MC_RGM_FES_F_FCCU_HARD_MASK32           ((uint32)0x00000100U)
    /* Flag for FXOSC frequency out-of-range */
    #define MC_RGM_FES_F_FXOSC_OR_MASK32            ((uint32)0x00000080U)
    /* Flag for Self Test done reset */
    #define MC_RGM_FES_F_ST_DONE_MASK32             ((uint32)0x00000040U)
    /* Flag for JTAG Functional reset */
    #define MC_RGM_FES_F_JTAG_FUNC_MASK32           ((uint32)0x00000020U)
    /* Flag for CM0 LOCKUP reset */
    #define MC_RGM_FES_F_CM0_LOCKUP_MASK32          ((uint32)0x00000010U)
    /* Flag for CM4 LOCKUP reset */
    #define MC_RGM_FES_F_CM4_LOCKUP_MASK32          ((uint32)0x00040000U)
    /* Flag for SWT0 timeout reset */
    #define MC_RGM_FES_F_SWT0_RST_REQ_MASK32        ((uint32)0x20000000U)
    /* Flag for SWT1 timeout reset */
    #define MC_RGM_FES_F_SWT1_RST_REQ_MASK32        ((uint32)0x10000000U)

#else

    /* Flag for JTAG 'functional' reset */
    #define MC_RGM_FES_F_JTAG_FUNC_MASK32           ((uint32)0x00000400U)
    /* Flag for FCCU soft reaction */
    #define MC_RGM_FES_F_FCCU_SOFT_MASK32           ((uint32)0x00000040U)
    /* Flag for FCCU hard reaction reset */
    #define MC_RGM_FES_F_FCCU_HARD_MASK32           ((uint32)0x00000020U)
    /* Flag for self test completed */
    #define MC_RGM_FES_F_ST_DONE_MASK32             ((uint32)0x00000004U)
    
#endif /* (IPV_MC == IPV_MC_05_00_00_10) */


/* Flag for JTAG or debug reset */
#define MC_RGM_FES_F_JTAG_OR_DBG_MASK32         ((uint32)0x00000400U)

/* Flag for software 'functional' reset */
#define MC_RGM_FES_F_SOFT_FUNC_MASK32           ((uint32)0x00000008U)

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    #define MC_RGM_FES_F_ESR1_MASK32            ((uint32)0x00000002U)
    #define MC_RGM_FES_F_ESR0_MASK32            ((uint32)0x00000001U)
#endif /* (IPV_MC == IPV_MC_04_00_15_15) */

#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_05_00_00_10) || \
     (IPV_MC == IPV_MC_05_00_00_07) || (IPV_MC == IPV_MC_04_06_05_00) || \
     (IPV_MC == IPV_MC_06_00_00_10) \
    )
    /* Flag for external reset */
    #define MC_RGM_FES_F_EXR_MASK32             ((uint32)0x00000001U)
#endif


/***********************************************/
/***************** MC_RGM_FERD *****************/
/***********************************************/
#if (IPV_MC == IPV_MC_04_04_01_00)
    /* used bits mask */
    #define MC_RGM_FERD_RWBITS_MASK32           ((uint32)0x0180046CU)
#elif (IPV_MC == IPV_MC_04_03_00_00)
    /* used bits mask */
    #define MC_RGM_FERD_RWBITS_MASK32           ((uint32)0x01800400U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* used bits mask */
    #define MC_RGM_FERD_RWBITS_MASK32           ((uint32)0x01800002U)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    /* used bits mask */
    #define MC_RGM_FERD_RWBITS_MASK32           ((uint32)0x01800000U)
#elif (IPV_MC == IPV_MC_04_06_05_00)
    /* used bits mask */
    #define MC_RGM_FERD_RWBITS_MASK32           ((uint32)0x00800400U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* used bits mask */
    #define MC_RGM_FERD_RWBITS_MASK32           ((uint32)0x0004C0B0U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* used bits mask */
    #define MC_RGM_FERD_RWBITS_MASK32           ((uint32)0x00027CB0U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    #define MC_RGM_FERD_RWBITS_MASK32           ((uint32)0x00000400U)
#endif

#if (IPV_MC == IPV_MC_05_00_00_10)
    /* reserved bits mask */
    #define MC_RGM_FERD_RESBITS_MASK32              ((uint32)0x00010000U)
#else
    /* reserved bits mask */
    #define MC_RGM_FERD_RESBITS_MASK32              ((uint32)0x00000000U)
#endif

#define MC_RGM_FERD_D_JTAG_OR_DBG_MASK32        ((uint32)0x00000400U)

#if (IPV_MC == IPV_MC_05_00_00_10)
    /* Disable LVW PD2 reset */
    #define MC_RGM_FERD_D_LVW_PD2_MASK32           ((uint32)0x00010000U)
    /* Disable LVD LV PD2 COLD reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FERD_D_LVD_LV_PD2_COLD_MASK32   ((uint32)0x00008000U)
    /* Disable HVD VDD LV PD2 reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FERD_D_HVD_VDD_LV_PD2_MASK32    ((uint32)0x00004000U)
    /* Disable FXOSC frequency out-of-range */
    #define MC_RGM_FERD_D_FXOSC_OR_MASK32          ((uint32)0x00000080U)
    /* Disable JTAG Functional reset */
    #define MC_RGM_FERD_D_JTAG_FUNC_MASK32         ((uint32)0x00000020U)
    /* Disable CM0 LOCKUP reset */
    #define MC_RGM_FERD_D_CM0_LOCKUP_MASK32        ((uint32)0x00000010U)
    /* Disable CM4 LOCKUP reset */
    #define MC_RGM_FERD_D_CM4_LOCKUP_MASK32        ((uint32)0x00040000U)
#endif /* (IPV_MC == IPV_MC_05_00_00_10) */


#if (IPV_MC == IPV_MC_05_00_00_07)
    /* Disable LVD LV PD2 COLD reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FERD_D_LVD_LV_PD2_COLD_MASK32   ((uint32)0x00020000U)
    /* Disable HVD LV COLD reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FERD_D_HVD_LV_COLD_MASK32       ((uint32)0x00004000U)
    /* Disable LVD IO A HI reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FERD_D_LVD_IO_A_HI_MASK32       ((uint32)0x00002000U)
    /* Disable Z2 Debug Rreset */
    #define MC_RGM_FERD_D_Z2_DBG_MASK32            ((uint32)0x00001000U)
    /* Disable Z4B Debug Reset */
    #define MC_RGM_FERD_D_Z4B_DBG_MASK32           ((uint32)0x00000800U)
    /* Disable Z4A Debug Reset */
    #define MC_RGM_FERD_D_Z4A_DBG_MASK32           ((uint32)0x00000400U)
    /* Disable OSC Frequency less than RC */
    #define MC_RGM_FERD_D_CMU_OLR_MASK32           ((uint32)0x00000080U)
    /* Disable JTAG Functional reset */
    #define MC_RGM_FERD_D_JTAG_FUNC_MASK32         ((uint32)0x00000020U)
    /* Disable Non Maskable Interrupt from Wakeup Unit */
    #define MC_RGM_FERD_D_NMI_WKPU_MASK32          ((uint32)0x00000010U)
#endif /* (IPV_MC == IPV_MC_05_00_00_07) */

