marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_RGM.h
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_04_01_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) \
    )
    /* Disable voltage out of range 'functional' reset */
    #define MC_RGM_FERD_D_VOR_FUNC_MASK32           ((uint32)0x01000000U)
#endif

/* Disable temperature sensor 'functional' reset */
#define MC_RGM_FERD_D_TSR_FUNC_MASK32           ((uint32)0x00800000U)

#if ((IPV_MC == IPV_MC_04_04_01_00) || \
     (IPV_MC == IPV_MC_04_03_00_00) || \
     (IPV_MC == IPV_MC_04_06_05_00) \
    )
    /* Disable JTAG 'functional' reset */
    #define MC_RGM_FERD_D_JTAG_FUNC_MASK32          ((uint32)0x00000400U)
#endif /* ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00)) */

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* Disable ESR1 External Reset */
    #define MC_RGM_FERD_D_ESR1_MASK32               ((uint32)0x00000002U)
#endif /* (IPV_MC == IPV_MC_04_00_15_15) */

#if (IPV_MC == IPV_MC_04_04_01_00)
    /* Disable FCCU soft reaction */
    #define MC_RGM_FERD_D_FCCU_SOFT_MASK32          ((uint32)0x00000040U)
    /* Disable FCCU hard reaction reset */
    #define MC_RGM_FERD_D_FCCU_HARD_MASK32          ((uint32)0x00000020U)
    /* Disable software 'functional' reset */
    #define MC_RGM_FERD_D_SOFT_FUNC_MASK32          ((uint32)0x00000008U)
    /* Disable self test completed */
    #define MC_RGM_FERD_D_ST_DONE_MASK32            ((uint32)0x00000004U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */


/***********************************************/
/***************** MC_RGM_FEAR *****************/
/***********************************************/
#if ((IPV_MC == IPV_MC_04_04_01_00) || \
     (IPV_MC == IPV_MC_04_03_00_00) || \
     (IPV_MC == IPV_MC_04_06_05_00) \
    )
    /* used bits mask */
    #define MC_RGM_FEAR_RWBITS_MASK32               ((uint32)0x01800400U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* used bits mask */
    #define MC_RGM_FEAR_RWBITS_MASK32               ((uint32)0x01800002U)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    /* used bits mask */
    #define MC_RGM_FEAR_RWBITS_MASK32               ((uint32)0x01800000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* used bits mask */
    #define MC_RGM_FEAR_RWBITS_MASK32               ((uint32)0x0000C020U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* used bits mask */
    #define MC_RGM_FEAR_RWBITS_MASK32               ((uint32)0x00027CB0U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    /* used bits mask */
    #define MC_RGM_FEAR_RWBITS_MASK32               ((uint32)0x00000000U)
#endif

#if (IPV_MC == IPV_MC_05_00_00_10)
    /* reserved bits mask */
    #define MC_RGM_FEAR_RESBITS_MASK32              ((uint32)0x00010000U)
#else
    /* reserved bits mask */
    #define MC_RGM_FEAR_RESBITS_MASK32              ((uint32)0x00000000U)
#endif /* (IPV_MC == IPV_MC_05_00_00_10) */

/* Alternate Request for voltage out of range 'functional' reset */
#define MC_RGM_FEAR_AR_VOR_FUNC_MASK32          ((uint32)0x01000000U)
/* Alternate Request for temperature sensor 'functional' reset */
#define MC_RGM_FEAR_AR_TSR_FUNC_MASK32          ((uint32)0x00800000U)

#if ((IPV_MC == IPV_MC_04_04_01_00) || \
     (IPV_MC == IPV_MC_04_03_00_00) || \
     (IPV_MC == IPV_MC_04_06_05_00) \
    )
    /* Alternate Request for JTAG 'functional' reset */
    #define MC_RGM_FEAR_AR_JTAG_FUNC_MASK32         ((uint32)0x00000400U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* Alternate Request for ESR1 External Reset */
    #define MC_RGM_FEAR_AR_ESR1_MASK32              ((uint32)0x00000002U)
#endif


#if (IPV_MC == IPV_MC_05_00_00_10)
    /* Alternate Request for LVD_LV_PD2_COLD */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FEAR_AR_LVD_LV_PD2_COLD_MASK32       ((uint32)0x00008000U)
    /* Alternate Request for HVD VDD LV PD2 reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FEAR_AR_HVD_VDD_LV_PD2_MASK32        ((uint32)0x00004000U)
    /* Alternate request FXOSC frequency out-of-range */
    #define MC_RGM_FEAR_AR_FXOSC_OR_MASK32              ((uint32)0x00000080U)
    /* Alternate request for JTAG Functional reset */
    #define MC_RGM_FEAR_AR_JTAG_FUNC_MASK32             ((uint32)0x00000020U)
#endif /* (IPV_MC == IPV_MC_05_00_00_10) */

#if (IPV_MC == IPV_MC_05_00_00_07)
    /* Alternate Request for LVD_LV_PD2_COLD */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FEAR_AR_LVD_LV_PD2_COLD_MASK32       ((uint32)0x00020000U)
    /* Alternate Request for HVD_LV_PD2_COLD */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FEAR_AR_HVD_LV_COLD_MASK32       ((uint32)0x00004000U)
    /* Alternate request for LVD IO A HI reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FEAR_AR_LVD_IO_A_HI_MASK32           ((uint32)0x00002000U)
    /* Alternate Request for Z2 Debug Reset */
    #define MC_RGM_FEAR_AR_Z2_DBG_MASK32                ((uint32)0x00001000U)
    /* Alternate Request for Z4B Debug Reset */
    #define MC_RGM_FEAR_AR_Z4B_DBG_MASK32               ((uint32)0x00000800U)
    /* Alternate Request for Z4A Debug Reset */
    #define MC_RGM_FEAR_AR_Z4A_DBG_MASK32               ((uint32)0x00000400U)
    /* Alternate Request for OSC Frequency less than RC */
    #define MC_RGM_FEAR_AR_CMU_OLR_MASK32               ((uint32)0x00000080U)
    /* Alternate request for JTAG Functional reset */
    #define MC_RGM_FEAR_AR_JTAG_FUNC_MASK32             ((uint32)0x00000020U)
    /* Alternate Request for Non Maskable Interrupt from Wakeup Unit */
    #define MC_RGM_FEAR_AR_NMI_WKPU_MASK32              ((uint32)0x00000010U)
#endif /* (IPV_MC == IPV_MC_05_00_00_10) */

/***********************************************/
/***************** MC_RGM_FBRE *****************/
/***********************************************/
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00))
    /* used bits mask */
    #define MC_RGM_FBRE_RWBITS_MASK32               ((uint32)0x01800468U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* used bits mask */
    #define MC_RGM_FBRE_RWBITS_MASK32               ((uint32)0x0180846AU)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    /* used bits mask */
    #define MC_RGM_FBRE_RWBITS_MASK32               ((uint32)0x01800468U)
#elif (IPV_MC == IPV_MC_04_06_05_00)
    /* used bits mask */
    #define MC_RGM_FBRE_RWBITS_MASK32               ((uint32)0x00800468U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* used bits mask */
    #define MC_RGM_FBRE_RWBITS_MASK32               ((uint32)0x00000000U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* used bits mask */
    #define MC_RGM_FBRE_RWBITS_MASK32               ((uint32)0x00021F7CU)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    /* used bits mask */
    #define MC_RGM_FBRE_RWBITS_MASK32               ((uint32)0x0000846CU)
#endif

