marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_RGM.h
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_04_01_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_06_00_00_10) \
    )
    /* reserved bits mask */
    #define MC_RGM_FBRE_RESBITS_MASK32              ((uint32)0x00000000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* reserved bits mask */
    #define MC_RGM_FBRE_RESBITS_MASK32              ((uint32)0x00000040U)
#elif (IPV_MC == IPV_MC_04_06_05_00)
    /* reserved bits mask */
    #define MC_RGM_FBRE_RESBITS_MASK32              ((uint32)0x01000000U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* reserved bits mask */
    #define MC_RGM_FBRE_RESBITS_MASK32              ((uint32)0x00016000U)
#endif

/* Bidirectional Reset Enable for voltage out of range 'functional' reset */
#define MG_RGM_FBRE_BE_VOR_FUNC_MASK32          ((uint32)0x01000000U)
/* Bidirectional Reset Enable for temperature sensor 'functional' reset */
#define MG_RGM_FBRE_BE_TSR_FUNC_MASK32          ((uint32)0x00800000U)

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* Bidirectional Reset Enable for HSM functional reset */
    #define MG_RGM_FBRE_BE_HSM_FUNC_MASK32          ((uint32)0x00008000U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* Bidirectional Reset Enable for HSM functional reset */
    #define MG_RGM_FBRE_BE_HSM_FUNC_MASK32          ((uint32)0x00000004U)
#endif

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* Bidirectional Reset Enable for SWT4 timeout reset */
    #define MG_RGM_FBRE_BE_SWT4_MASK32              ((uint32)0x00008000U)
#endif

#if (IPV_MC == IPV_MC_05_00_00_07)

    /* Bidirectional Reset Enable for PD2 LVD at Cold Point */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MG_RGM_FBRE_BE_LVD_LV_PD2_COLD_MASK32   ((uint32)0x00020000U)
    /* Bidirectional Reset Enable for Z2 debug reset */
    #define MG_RGM_FBRE_BE_Z2_DBG_MASK32            ((uint32)0x00001000U)
    /* Bidirectional Reset Enable for Z4B debug reset */
    #define MG_RGM_FBRE_BE_Z4B_DBG_MASK32           ((uint32)0x00000800U)
    /* Bidirectional Reset Enable for Z4A debug reset */
    #define MG_RGM_FBRE_BE_Z4A_DBG_MASK32           ((uint32)0x00000400U)
    /* Bidirectional Reset Enable for FCCU SHORT reaction reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MG_RGM_FBRE_BE_FCCU_SHORT_MASK32        ((uint32)0x00000200U)
    /* Bidirectional Reset Enable for FCCU LONG reaction reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MG_RGM_FBRE_BE_FCCU_LONG_MASK32         ((uint32)0x00000100U)
    /* Bidirectional Reset Enable for OSC Frequency less than RC */
    #define MG_RGM_FBRE_BE_CMU_OLR_MASK32           ((uint32)0x00000080U)
    /* Bidirectional Reset Enable for JTAG Functional reset */
    #define MG_RGM_FBRE_BE_JTAG_FUNC_MASK32         ((uint32)0x00000020U)
    /* Bidirectional Reset Enable for Non Maskable Interrupt from Wakeup Unit */
    #define MG_RGM_FBRE_BE_NMI_WKPU_MASK32          ((uint32)0x00000010U)

#elif (IPV_MC == IPV_MC_05_00_00_10)

    /* Bidirectional Reset Enable for SWT2 timeout reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MG_RGM_FBRE_BE_SWT2_RST_REQ_MASK32      ((uint32)0x08000000U)
    /* Bidirectional Reset Enable for CM0 software reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MG_RGM_FBRE_BE_CM0_RST_REQ_MASK32       ((uint32)0x04000000U)
    /* Bidirectional Reset Enable for LVW PD2 reset */
    #define MG_RGM_FBRE_BE_LVW_PD2_MASK32           ((uint32)0x00010000U)
    /* Bidirectional Reset Enable for LVD LV PD2 COLD reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MG_RGM_FBRE_BE_LVD_LV_PD2_COLD_MASK32   ((uint32)0x00008000U)
    /* Bidirectional Reset Enable for HVD VDD LV PD2 reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MG_RGM_FBRE_BE_HVD_VDD_LV_PD2_MASK32    ((uint32)0x00004000U)
    /* Bidirectional Reset Enable for LVD IO A HI reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MG_RGM_FBRE_BE_LVD_IO_A_HI_MASK32       ((uint32)0x00002000U)
    /* Bidirectional Reset Enable for FCCU Soft reaction reset */
    #define MG_RGM_FBRE_BE_FCCU_SOFT_MASK32         ((uint32)0x00000200U)
    /* Bidirectional Reset Enable for FCCU Hard reaction reset */
    #define MG_RGM_FBRE_BE_FCCU_HARD_MASK32         ((uint32)0x00000100U)
    /* Bidirectional Reset Enable for FXOSC frequency out-of-range */
    #define MG_RGM_FBRE_BE_FXOSC_OR_MASK32          ((uint32)0x00000080U)
    /* Bidirectional Reset Enable for Self Test done reset */
    #define MG_RGM_FBRE_BE_ST_DONE_MASK32           ((uint32)0x00000040U)
    /* Bidirectional Reset Enable for JTAG Functional reset */
    #define MG_RGM_FBRE_BE_JTAG_FUNC_MASK32         ((uint32)0x00000020U)

#else

    /* Bidirectional Reset Enable for JTAG 'functional' reset */
    #define MG_RGM_FBRE_BE_JTAG_FUNC_MASK32         ((uint32)0x00000400U)
    /* Bidirectional Reset Enable for FCCU soft reaction */
    #define MG_RGM_FBRE_BE_FCCU_SOFT_MASK32         ((uint32)0x00000040U)
    /* Bidirectional Reset Enable for a FCCU hard reaction */
    #define MG_RGM_FBRE_BE_FCCU_HARD_MASK32         ((uint32)0x00000020U)

#endif /* (IPV_MC == IPV_MC_05_00_00_10) */

/* Bidirectional Reset Enable for JTAG or debug reset */
/** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MG_RGM_FBRE_BE_JTAG_OR_DBG_MASK32       ((uint32)0x00000400U)

/* Bidirectional Reset Enable for software 'functional' reset */
#define MG_RGM_FBRE_BE_SOFT_FUNC_MASK32         ((uint32)0x00000008U)

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* Bidirectional Reset Enable for ESR1 External Reset */
    #define MG_RGM_FBRE_BE_ESR1_MASK32              ((uint32)0x00000002U)
#endif

#if ((IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_06_00_00_10))
    /* Bidirectional Reset Enable for Self Test Completed 'Functional' Reset */
    #define MG_RGM_FBRE_BE_ST_DONE_MASK32           ((uint32)0x00000004U)
#endif /* (IPV_MC == IPV_MC_04_06_01_00) */

/* Bidirectional Reset Enable for ESR0 External Reset */
#define MG_RGM_FBRE_BE_ESR0_MASK32              ((uint32)0x00000001U)

/***********************************************/
/***************** MC_RGM_FESS *****************/
/***********************************************/
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) \
    )
    /* used bits mask */
    #define MC_RGM_FESS_RWBITS_MASK32               ((uint32)0x00800409U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* used bits mask */
    #define MC_RGM_FESS_RWBITS_MASK32               ((uint32)0x0180040BU)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* used bits mask */
    #define MC_RGM_FESS_RWBITS_MASK32               ((uint32)0x3C04C0A8U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* used bits mask */
    #define MC_RGM_FESS_RWBITS_MASK32               ((uint32)0x00027CB9U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    /* used bits mask */
    #define MC_RGM_FESS_RWBITS_MASK32               ((uint32)0x00008409U)
#endif

