marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_RGM.h
#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_06_01_00))
    /* reserved bits mask */
    #define MC_RGM_FESS_RESBITS_MASK32              ((uint32)0x00000040U)
#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00) || \
       (IPV_MC == IPV_MC_06_00_00_10) \
      )
    /* reserved bits mask */
    #define MC_RGM_FESS_RESBITS_MASK32              ((uint32)0x00000000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* reserved bits mask */
    #define MC_RGM_FESS_RESBITS_MASK32              ((uint32)0x00000200U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* reserved bits mask */
    #define MC_RGM_FESS_RESBITS_MASK32              ((uint32)0x00008040U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* reserved bits mask */
    #define MC_RGM_FESS_RESBITS_MASK32              ((uint32)0x00000204U)
#endif

/* Short Sequence for voltage out of range 'functional' reset */
#define MC_RGM_FESS_SS_VOR_FUNC_MASK32          ((uint32)0x01000000U)
/* Short Sequence for temperature sensor 'functional' reset */
#define MC_RGM_FESS_SS_TSR_FUNC_MASK32          ((uint32)0x00800000U)

#if (IPV_MC == IPV_MC_05_00_00_07)

    /* Short Sequence for PD2 LVD at Cold Point */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FESS_SS_LVD_LV_PD2_COLD_MASK32       ((uint32)0x00020000U)
    /* Short Sequence for High Voltage Detect IOs */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FESS_SS_HVD_LV_COLD_MASK32           ((uint32)0x00004000U)
    /* Short Sequence for Low Voltage Detect IOs */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FESS_SS_LVD_IO_A_HI_MASK32           ((uint32)0x00002000U)
    /* Short Sequence for Z2 Debug Reset */
    #define MG_RGM_FESS_SS_Z2_DBG_MASK32                ((uint32)0x00001000U)
    /* Short Sequence for Z4B Debug Reset */
    #define MG_RGM_FESS_SS_Z4B_DBG_MASK32               ((uint32)0x00000800U)
    /* Short Sequence for Z4A Debug Reset */
    #define MG_RGM_FESS_SS_Z4A_DBG_MASK32               ((uint32)0x00000400U)
    /* Short Sequence for OSC Frequency less than RC */
    #define MG_RGM_FESS_SS_CMU_OLR_MASK32               ((uint32)0x00000080U)
    /* Short Sequence for JTAG Functional Reset */
    #define MC_RGM_FESS_SS_JTAG_FUNC_MASK32             ((uint32)0x00000020U)
    /* Short Sequence for Non Maskable Interrupt 3 Wakeup Unit */
    #define MG_RGM_FESS_SS_NMI_WKPU_MASK32              ((uint32)0x00000010U)

#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* Short Sequence for SWT2 timeout reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FESS_SS_SWT2_RST_REQ_MASK32      ((uint32)0x08000000U)
    /* Short Sequence for CM0 sofware reset */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FESS_SS_CM0_RST_REQ_MASK32       ((uint32)0x04000000U)
    /* Short Sequence for SS_LVD_LV_PD2_COLD */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FESS_SS_LVD_LV_PD2_COLD_MASK32   ((uint32)0x00008000U)
    /* Short Sequence for SS_HVD_VDD_LV_PD2 */
    /** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_RGM_FESS_SS_HVD_VDD_LV_PD2_MASK32    ((uint32)0x00004000U)
    /* Short Sequence for FCCU Soft reaction reset */
    #define MC_RGM_FESS_SS_FCCU_SOFT_MASK32         ((uint32)0x00000200U)
    /* Short Sequence for FCCU Hard reaction reset */
    #define MC_RGM_FESS_SS_FCCU_HARD_MASK32         ((uint32)0x00000100U)
    /* Short Sequence for FXOSC frequency out-of-range */
    #define MC_RGM_FESS_SS_FXOSC_OR_MASK32          ((uint32)0x00000080U)
    /* Short Sequence for Self Test done reset */
    #define MC_RGM_FESS_SS_ST_DONE_MASK32           ((uint32)0x00000040U)
    /* Short Sequence for JTAG Functional reset */
    #define MC_RGM_FESS_SS_JTAG_FUNC_MASK32         ((uint32)0x00000020U)
    /* Short Sequence for CM4 LOCKUP */
    #define MC_RGM_FESS_SS_CM4_LOCKUP_MASK32        ((uint32)0x00040000U)
    /* Short Sequence for SWT0 timeout reset */
    #define MC_RGM_FESS_SS_SWT0_RST_REQ_MASK32      ((uint32)0x20000000U)
    /* Short Sequence for SWT1 timeout reset */
    #define MC_RGM_FESS_SS_SWT1_RST_REQ_MASK32      ((uint32)0x10000000U)
#else
    /* Short Sequence for JTAG 'functional' reset */
    #define MC_RGM_FESS_SS_JTAG_FUNC_MASK32         ((uint32)0x00000400U)
#endif /* (IPV_MC == IPV_MC_05_00_00_10) */

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* Short Sequence for SWT4 timeout reset */
    #define MC_RGM_FESS_SS_SWT4_MASK32              ((uint32)0x00008000U)
    /* Short Sequence for JTAG or DBG reset */
    #define MC_RGM_FESS_SS_JTAG_OR_DBG_MASK32       ((uint32)0x00000400U)
    /* Short Sequence for external reset */
    #define MC_RGM_FESS_SS_EXT_RST_MASK32           ((uint32)0x00000001U)
#endif

/* Short Sequence for software 'functional' reset */
#define MC_RGM_FESS_SS_SOFT_FUNC_MASK32         ((uint32)0x00000008U)

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* Short Sequence for ESR1 External Reset */
    #define MC_RGM_FESS_SS_ESR1_MASK32              ((uint32)0x00000002U)
    /* Short Sequence for ESR0 External Reset */
    #define MC_RGM_FESS_SS_ESR0_MASK32              ((uint32)0x00000001U)
#endif

#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_04_03_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) ||\
     (IPV_MC == IPV_MC_05_00_00_10) || (IPV_MC == IPV_MC_05_00_00_07) \
    )
/* Short Sequence for EXR External Reset */
#define MC_RGM_FESS_SS_EXR_MASK32               ((uint32)0x00000001U)
#endif

/***********************************************/
/***************** MC_RGM_EROEC ****************/
/***********************************************/
#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
#define MC_RGM_EROEC_RWBITS_MASK32              ((uint32)0x00000001U)
#define MC_RGM_EROEC_RESBITS_MASK32             ((uint32)0x00000000U)

/* External Reset Input Status */
#define MC_RGM_EROEC_ERIS_MASK32                ((uint32)0x00000002U)
/* External Reset Output Assertion Control */
#define MC_RGM_EROEC_EROEC_MASK32               ((uint32)0x00000001U)
#endif


/***********************************************/
/*************** MC_RGM_DDR_HE *****************/
/***********************************************/
#define MC_RGM_DDR_HE_RWBITS_MASK32              ((uint32)0xFFFF0001U)

/** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_RGM_DDR_HE_HNDSHK_TO_VAL_MASK32       ((uint32)0xFFFF0000U)
/** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_RGM_DDR_HE_HNDSHK_TO_VAL_SHIFT32      ((uint32)16U)

#define MC_RGM_DDR_HE_HNDSHK_EN_MASK32           ((uint32)0x00000001U)

/***********************************************/
/*************** MC_RGM_DDR_HS *****************/
/***********************************************/
#define MC_RGM_DDR_HS_RWBITS_MASK32              ((uint32)0x00000002U)

/** @violates @ref REG_ESYS_MC_RGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_RGM_DDR_HS_HNDSHK_DONE_MASK32         ((uint32)0x00000002U)

/***********************************************/
/*************** MC_RGM_FRHE *******************/
/***********************************************/
#define MC_RGM_FRHE_RWBITS_MASK32              ((uint32)0x0000846DU)

#define MC_RGM_FRHE_HE_SWT4_MASK32             ((uint32)0x00008000U)
#define MC_RGM_FRHE_HE_JTAG_OR_DBG_MASK32      ((uint32)0x00000400U)
#define MC_RGM_FRHE_HE_FCCU_SOFT_MASK32        ((uint32)0x00000040U)
#define MC_RGM_FRHE_HE_FCCU_HARD_MASK32        ((uint32)0x00000020U)
#define MC_RGM_FRHE_HE_SOFT_FUNC_MASK32        ((uint32)0x00000008U)
#define MC_RGM_FRHE_HE_ST_DONE_MASK32          ((uint32)0x00000004U)
#define MC_RGM_FRHE_HE_EXT_RST_MASK32          ((uint32)0x00000001U)


/***********************************************/
/***************  MC_RGM_FRET  *****************/
/***********************************************/
#define MC_RGM_FRET_RWBITS_MASK8                ((uint8)0x0FU)
#define MC_RGM_FRET_RESBITS_MASK8               ((uint8)0x00U)

/***********************************************/
/***************  MC_RGM_DRET  *****************/
/***********************************************/
#define MC_RGM_DRET_RWBITS_MASK8                ((uint8)0x0FU)
#define MC_RGM_DRET_RESBITS_MASK8               ((uint8)0x00U)

/*==================================================================================================
*                                             ENUMS
==================================================================================================*/


/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/


/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/


/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/



#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_MC_RGM_H */

/** @} */
